Repository: fgtclb/academic-persons
Catalog: Resources/Private/Language/*.locallang_*.xlf
Languages: de

# extension_configuration.types.profileTypes.label
source: Profile Types: Comma-separated list of profile types
de: Profiltypen: Kommagetrennte Liste von Profiltypen

# extension_configuration.types.physicalAddressTypes.label
source: Physical Address Types: Comma-separated list of physical address types
de: Physikalische Adresstypen: Kommagetrennte Liste von physischen Adresstypen

# extension_configuration.types.emailAddressTypes.label
source: Email Address Types: Comma-separated list of email address types
de: E-Mail Adresstypen: Kommagetrennte Liste von E-Mail-Adresstypen

# extension_configuration.types.phoneNumberTypes.label
source: Phone Number Types: Comma-separated list of phone number types
de: Rufnummertypen: Kommagetrennte Liste von Rufnummertypen

# extension_configuration.demand.allowedGroupByValues.label
source: Group By Values: Comma-separated list of allowed group by values
de: Nach Werten gruppieren: Kommagetrennte Liste von zulässigen Gruppierungswerten

# extension_configuration.demand.allowedSortByValues.label
source: Sort By Values: Comma-separated list of allowed sort by values
de: Nach Werten sortieren: Kommagetrennte Liste von zulässigen Sortierwerten

# extension_configuration.profile.autoCreateProfiles.label
source: Auto create profile: Automatically creates a new profile for FE users
de: Automatisch Profil erstellen: Legt automatisch ein neues Profil für FE Benutzer an

# extension_configuration.profile.createProfileForUserGroups.label
source: Create for user groups: Create profiles only if current user is in one of these user group IDs.
de: Für Benutzergruppen erstellen: Legt Profile an, wenn der aktuelle Benutzer Teil dieser Gruppen-IDs ist

# plugin.list.label
source: Persons List
de: Personen Liste

# plugin.detail.label
source: Persons Detail
de: Personen Detail

# plugin.listAndDetail.label
source: Persons List and Detail
de: Personen Liste and Detail

# newContentElement.wizardItems.academic
source: Academic
de: Akademisch

# newContentElement.wizardItems.academic.list.title
source: Persons List
de: Personen Liste

# newContentElement.wizardItems.academic.list.description
source: Plugin for listing academic persons
de: Plugin zur Auflistung akademischer Personen

# newContentElement.wizardItems.academic.detail.title
source: Persons Detail
de: Personen Detail

# newContentElement.wizardItems.academic.detail.description
source: Plugin for viewing single academic persons
de: Plugin zur Ansicht einzelner akademischer Personen

# newContentElement.wizardItems.academic.listAndDetail.title
source: Persons List and Detail
de: Personen Liste und Detail

# newContentElement.wizardItems.academic.listAndDetail.description
source: Plugin for listing and viewing academic persons
de: Plugin zur Auflistung und Ansicht akademischer Personen

# newContentElement.wizardItems.academic.card.title
source: Contacts
de: Kontakte

# newContentElement.wizardItems.academic.card.description
source: Adds one or more contacts
de: Fügt ein oder mehrere Kontakte hinzu

# element.tab.configuration
source: Configuration
de: Konfiguration

# flexform.tab.settings
source: Settings
de: Einstellungen

# flexform.el.detailPid.label
source: Detail Page
de: Detail Seite

# flexform.el.listPid.label
source: List Page
de: Listen Seite

# flexform.el.functionTypes.label
source: Function Types
de: Funktionstypen

# flexform.el.groupBy.label
source: Group By (is given priority in sorting if activ)
de: Gruppieren nach (wird vorrangig bei der Sortierung berücksichtigt)

# flexform.el.groupBy.items.none
source: No grouping
de: Keine Gruppierung

# flexform.el.groupBy.items.first_name
source: First Letter of First Name
de: Erster Buchstabe des Vornamens

# flexform.el.groupBy.items.last_name
source: First Letter of Last Name
de: Erster Buchstabe des Nachnamens

# flexform.el.organisationalUnits.label
source: Organisational Units
de: Organisationseinheiten

# flexform.el.sortBy.label
source: Sort By (sorting of activated grouping has priority)
de: Sortieren nach (wird nachrangig bei aktivierter Gruppierung berücksichtigt)

# flexform.el.selectedContracts.label
source: Selected Contracts
de: Ausgewählte Verträge

# flexform.el.selectedProfiles.label
source: Selected Profiles
de: Ausgewählte Profile

# flexform.el.showFields.label
source: Show only selected Fields
de: Nur ausgewählte Felder anzeigen

# flexform.el.showFields.groups.profile
source: Profile
de: Profil

# flexform.el.showFields.groups.contracts
source: Contracts
de: Verträge

# flexform.el.sortBy.items.none
source: No sorting
de: Keine Sortierung

# flexform.el.sortBy.items.first_name
source: First Name
de: Vorname

# flexform.el.sortBy.items.last_name
source: Last Name
de: Nachname

# flexform.el.sortByDirection.label
source: Sort By Direction
de: Nach Richtung sortieren

# flexform.el.sortByDirection.items.asc
source: Ascending
de: Aufsteigend

# flexform.el.sortByDirection.items.desc
source: Descending
de: Absteigend

# flexform.el.alphabetPaginationEnabled.label
source: Alphabetical Pagination
de: Alphabetische Paginierung

# flexform.el.alphabetPaginationEnabled.items.0.label
source: Enabled
de: Aktiviert

# flexform.el.paginationEnabled.label
source: Pagination
de: Paginierung

# flexform.el.paginationEnabled.items.0.label
source: Enabled
de: Aktiviert

# flexform.el.resultsPerPage.label
source: Results per Page
de: Ergebnisse pro Seite

# flexform.el.numberOfLinks.label
source: Number of Links
de: Anzahl der Links

# flexform.el.pageTitleFormat.label
source: PageTitle display format
de: Seitentitel Anzeige Format

# flexform.el.pageTitleFormat.listanddetail_description
source: for person detail page
de: für Person Detailansicht

# flexform.el.pageTitleFormat.items.none
source: Default page title
de: Standard Seitentitel

# flexform.el.pageTitleFormat.items.tiltefirstmiddlelastname
source: Title Firstname Middlename Lastname
de: Titel Vorname Mittelname Nachname

# flexform.el.pageTitleFormat.items.lastcommafirstmiddlename
source: Lastname, Firstname Middlename
de: Nachname, Vorname Mittelname

# flexform.el.profileList.label
source: List of profiles
de: Liste von Profilen

# flexform.el.fallbackForNonTranslated.label
source: Fallback to default language for non translated profiles
de: Fallback auf die Standardsprache für nicht übersetzte Profile

# flexform.el.viewMode.enabled.label
source: View Mode Toggle
de: Ansichtsmodus-Umschalter

# flexform.el.viewMode.enabled.items.0.label
source: Enabled
de: Aktiviert

# flexform.el.viewMode.default.label
source: View Mode Default
de: Standard für Ansichtsmodus

# flexform.el.viewMode.default.I.list
source: List
de: Liste

# flexform.el.viewMode.default.I.table
source: Table
de: Tabelle
